Revit 2026 API

# DockablePane(DockablePane) Constructor

---

Constructs a new copy of the input DockablePane object.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DockablePane(
	DockablePane other
)
```
```vb
Public Sub New (
	other As DockablePane
)
```
```cpp
public:
DockablePane(
	DockablePane^ other
)
```
```fsharp
new :
        other : DockablePane -> DockablePane
```

#### Parameters

other DockablePane

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

DockablePane Class

DockablePane Overload

Autodesk.Revit.UI Namespace